InformationRegisters/инт_НастройкиСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>инт_НастройкиСистемы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрокаНеограниченная</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>РазделНастроек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_РазделНастроек</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/инт_НастройкиСистемы/Forms/ФормаЗаписи/Ext/Form/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Модуль формы записи регистра сведений инт_НастройкиСистемы.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

// Инициализация формы записи.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастроитьДоступностьПоказатьСодержимоеНаСервере();
	
КонецПроцедуры

// После чтения записи обновляет доступность команды просмотра.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НастроитьДоступностьПоказатьСодержимоеНаСервере();
	
КонецПроцедуры

// После записи сбрасывает кэш повторно используемых значений и обновляет доступность команды.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	НастроитьДоступностьПоказатьСодержимоеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// При смене раздела настроек обновляет доступность команды просмотра.
//
&НаКлиенте
Процедура РазделНастроекПриИзменении(Элемент)
	
	НастроитьДоступностьПоказатьСодержимоеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Открывает текстовое представление содержимого хранилища значений записи.
//
&НаКлиенте
Процедура ПоказатьСодержимое(Команда)
	
	РезультатПросмотра = ПолучитьТекстСодержимогоТекущейЗаписиНаСервере();
	
	Если Не РезультатПросмотра.Успех Тогда
		
		ПоказатьПредупреждение(, РезультатПросмотра.Текст);
		Возврат;
		
	КонецЕсли;
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(РезультатПросмотра.Текст);
	ТекстовыйДокумент.Показать(РезультатПросмотра.Заголовок);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Устанавливает доступность команды «Показать содержимое» по данным хранилища записи.
//
&НаСервере
Процедура НастроитьДоступностьПоказатьСодержимоеНаСервере()
	
	Элементы.ФормаПоказатьСодержимое.Доступность = ЕстьСодержимоеВТекущейЗаписи();
	
КонецПроцедуры

// Проверяет наличие значения в хранилище текущей записи формы.
//
// Возвращаемое значение:
//  Булево - Истина, если хранилище заполнено.
//
&НаСервере
Функция ЕстьСодержимоеВТекущейЗаписи()
	
	Если ТипЗнч(Запись.ЗначениеХранилище) = Тип("ХранилищеЗначения") Тогда
		
		Если Запись.ЗначениеХранилище.Получить() <> Неопределено Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РегистрыСведений.инт_НастройкиСистемы.ЕстьСодержимоеХранилища(Запись.РазделНастроек);
	
КонецФункции

// Формирует текстовое представление содержимого хранилища текущей записи.
//
// Возвращаемое значение:
//  Структура - результат просмотра (Успех, Текст, Заголовок).
//
&НаСервере
Функция ПолучитьТекстСодержимогоТекущейЗаписиНаСервере()
	
	Если ТипЗнч(Запись.ЗначениеХранилище) = Тип("ХранилищеЗначения") Тогда
		
		ИзвлеченноеЗначение = Запись.ЗначениеХранилище.Получить();
		
		Если ИзвлеченноеЗначение <> Неопределено Тогда
			
			Результат = Новый Структура("Успех, Текст, Заголовок", Истина, "", "");
			Результат.Заголовок = "Содержимое настройки: " + Строка(Запись.РазделНастроек);
			Результат.Текст = РегистрыСведений.инт_НастройкиСистемы.СформироватьПредставлениеЗначения(ИзвлеченноеЗначение);
			Возврат Результат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РегистрыСведений.инт_НастройкиСистемы.ПолучитьТекстСодержимогоХранилища(Запись.РазделНастроек);
	
КонецФункции

#КонецОбласти
